using System.Diagnostics.CodeAnalysis;

namespace BanderaBot.Host.Resources;

[SuppressMessage("ReSharper", "StringLiteralTypo")]
public static class Blames
{
    public static string[]? UnformattedList = {
        "Ти нормальною мовою розмовляти вмієш?",
        "Не розумію: чи то хтось пернув чи то москальскою заговорив?",
        "Вуха в'януть від твоєї мордорської мови.",
        "Браття, здається серед нас москальський агент.",
        "Russian sucks!",
        "Ой лишенько, зараз блювону від цієї кацапської.",
        "Не буду тикати пальцями, але в когось з рота смердить російською.",
        "Після оцього що сказав - почисть зуби. А то російською смердітиме.",
        "Був би я собакою - напісяв би тобі в тапки за такі слова.",
        "Як казав Соломон: 'мовчання - золото ... а російська - гівно'. То краще помовчи.",
        "Інстасамку переслухав чи що?"
    };
    
    public static readonly string[] FormattedList = {
        "{0}, ну ти ж ніби нормальна людина? То і говори нормально мовою.",
        "{0}, вийди звідси! Розбійник російськомовний!",
        "Я вже викликав СБУ. Чекай гостей, {0}! їм своєю кацапською побалакаєш!",
        "{0}, може вакзал, масква, расєя ... з такою говіркою?",
        "Голосування за виганяння з чату {0} за пропагування гівноросійської розпочато!",
        "Це ти, {0}, там російською кукурікаєш?",
        "Папка з твоїм досьє, {0}, уже на столі у Буданова. Перевірка на москаля почалась.",
        "Дякую тобі Боже, що я не москаль. А от на рахунок тебе, {0} - я не впевнений.",
        "Бісиш, {0}, навіть через монітор! Так би вмазав!"
    };

    public static readonly IEnumerable<string> List = UnformattedList.Union(FormattedList);
}